tests/load/results/embedding/embedding-standard_20251123_061456.txt

Summary:
  Total:	2.9118 secs
  Slowest:	0.3247 secs
  Fastest:	0.0600 secs
  Average:	0.0909 secs
  Requests/sec:	686.8629
  
  Total data:	30000 bytes
  Size/request:	15 bytes

Response time histogram:
  0.060 [1]	|
  0.086 [1389]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.113 [157]	|■■■■■
  0.139 [311]	|■■■■■■■■■
  0.166 [72]	|■■
  0.192 [24]	|■
  0.219 [26]	|■
  0.245 [6]	|
  0.272 [11]	|
  0.298 [0]	|
  0.325 [3]	|


Latency distribution:
  10% in 0.0639 secs
  25% in 0.0663 secs
  50% in 0.0793 secs
  75% in 0.0928 secs
  90% in 0.1374 secs
  95% in 0.1428 secs
  99% in 0.2191 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0047 secs, 0.0600 secs, 0.3247 secs
  DNS-lookup:	0.0002 secs, 0.0000 secs, 0.0111 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0001 secs
  resp wait:	0.0862 secs, 0.0600 secs, 0.2268 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0002 secs

Status code distribution:
  [502]	2000 responses